"""
https://judge.softuni.org/Contests/2418

Григор Димитров е тенисист, чиято следваща цел е изкачването в световната ранглиста по тенис за мъже.
През годината Гришо участва в определен брой турнири, като за всеки турнир получава точки, които зависят от позицията,
на която е завършил в турнира. Има три варианта за завършване на турнир:
	W - ако е победител получава 2000 точки
	F - ако е финалист получава 1200 точки
	SF - ако е полуфиналист получава 720 точки
Напишете програма, която изчислява колко ще са точките на Григор след изиграване на всички турнири,
като знаете с колко точки стартира сезона. Също изчислете колко точки средно печели от всички изиграни турнири
и колко процента от турнирите е спечелил.

Вход
От конзолата първо се четат два реда:
•	Брой турнири, в които е участвал – цяло число в интервала [1…20]
•	Начален брой точки в ранглистата - цяло число в интервала [1...4000]
За всеки турнир се прочита отделен ред:
•	Достигнат етап от турнира – текст – "W", "F" или "SF"

Изход
Отпечатват се три реда в следния формат:
•	"Final points: {брой точки след изиграните турнири}"
•	"Average points: {средно колко точки печели за турнир}"
•	"{процент спечелени турнири}%"
Средните точки да бъдат закръглени към най-близкото цяло число надолу,
а процентът да се форматира до втората цифра след десетичния знак.
"""

tournaments_count = int(input())
ranglist_points = int(input())

points_won = 0
wins = 0

for tournament in range(tournaments_count):
    reached_stage = input()
    if reached_stage == 'W':
        points_won += 2000
        wins += 1
    elif reached_stage == 'F':
        points_won += 1200
    elif reached_stage == 'SF':
        points_won += 720

total_points = ranglist_points + points_won
average_points = points_won // tournaments_count
percent_wins = wins / tournaments_count * 100

print(f'Final points: {total_points}')
print(f'Average points: {average_points}')
print(f'{percent_wins:.2f}%')