"""
Футболен отбор участва в благотворителен турнир. На този турнир отборът играе три мача като домакин.
Да се напише програма, която изчислява колко победи, равенства и загуби има отборът по време на турнира,
спрямо резултатите от мачовете.
*Забележка: Отборът винаги е домакин, следователно първата цифра от резултата съответства на головете вкарани от него.
Вход
От конзолата се четат 3 реда:
1.	Резултат от първия мач – текст
2.	Резултат от втория мач – текст
3.	Резултат от третия мач – текст
Резултатите ще са в следния формат: "2:0", "0:1", "1:1" и т.н.
/броят голове винаги ще бъде едноцифрено число/
Изход
На конзолата да се отпечатат три реда:
•	"Team won {брой спечелени мачове} games."
•	"Team lost {брой загубени мачове} games."
•	" Drawn games: {брой равни мачове}"
"""

host_1,a,guest_1 = input()
host_2,b,guest_2 = input()
host_3,c,guest_3 = input()

wins = 0
loses = 0
draws = 0

print(f'Team won {wins} games.')
print(f'Team lost {loses} games.')
print(f'Drawn games: {draws}')

#--------------------------------------------
# a,b,c = input()
# d,e,f = input()
# g,h,i = input()
# win = 0
# k = 0
# r = 0
# if a>c:
#     win = win +1
# elif a<c:
#     k=k+1
# elif a==c:
#     r = r+1
# if d > f:
#     win = win + 1
# elif d < f:
#     k = k + 1
# elif d == f:
#     r = r + 1
# if g>i:
#     win = win + 1
# elif g < i:
#     k = k + 1
# elif g == i:
#     r = r + 1
# print(f"Team won {win} games.")
# print(f"Team lost {k} games.")
# print(f"Drawn games: {r}")