# Напишете програма, която чете цяло положително число n, въведено от потребителя
# и чертае на конзолата квадратна рамка с размер n * n като в примерите по-долу:

n = int(input())

for row in range(1):
    print('+ ', (n - 2) * '- ', '+', sep='', end='')
    print()
    for col in range(n - 2):
        print('| ', (n - 2) * '- ', '|', sep='', end='')
        print()
    print('+ ', (n - 2) * '- ', '+', sep='', end='')

# ---------------------------------------------------------------

# n = int(input())
#
# for row in range(1, n + 1):
#     if row == 1 or n == row:
#         print("+ " + (n - 2) * "- " + "+ ")
#     else:
#         print("| " + (n - 2) * "- " + "| ")