"""
https://judge.softuni.org/Contests/Compete/Index/2424#6

Ресторант отваря врати и предлага няколко менюта на преференциални цени:
•	Пилешко меню –  10.35 лв.
•	Меню с риба – 12.40 лв.
•	Вегетарианско меню  – 8.15 лв.
Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).
Цената на доставка е 2.50 лв и се начислява най-накрая.

Вход
От конзолата се четат 3 реда:
•	Брой пилешки менюта – цяло число в интервала [0 … 99]
•	Брой менюта с риба – цяло число в интервала [0 … 99]
•	Брой вегетариански менюта – цяло число в интервала [0 … 99]

Изход
Да се отпечата на конзолата един ред:  "{цена на поръчката}"
"""
count_chicken = int(input()) * 10.35
count_fish = int(input()) * 12.4
count_vegetarian = int(input()) * 8.15

order_sum = count_chicken + count_fish + count_vegetarian
dessert = order_sum * 0.2
total_sum = order_sum + dessert + 2.5

print(total_sum)