"""
https://judge.softuni.org/Contests/Practice/Index/2275#4

Сезона за изкачване на алпийски върхове започва и всички алпинисти, се запасяват с енергийни гелове за изкачването.
Фирма предлага малки и големи разфасовки с по 2 бр. и 5 бр. енергийни гела, като цената на един гел зависи от плодовете,
 от които е направен. В зависимост от размера на разфасовката, цената за брой енергиен гел е различна.
 От конзолата се четат плодовете, размерът на опаковката ((малка) 2 бр. или (голяма) 5 бр.), както и колко разфасовки
 са поръчани. Да се напише програма, която изчислява сумата, която трябва да се плати за поръчката.

	                Диня 	            Манго	            Ананас	            Малина
2 броя (small)	56 лв./бр.	        36.66 лв./бр.	    42.10 лв./бр.	    20 лв./бр.
5 броя (big)	28.70 лв./бр.	    19.60 лв./бр.	    24.80 лв./бр.	    15.20 лв./бр.

При поръчки:
•	от 400 лв. до 1000 лв. включително има 15% отстъпка
•	над 1000 лв. има 50% отстъпка

Вход
От конзолата се четат 3 реда:
1.	Плод - текст с възможности: "Watermelon", "Mango", "Pineapple" или "Raspberry"
2.	Размерът на сета - текст с възможности: "small" или "big"
3.	Брой на поръчаните сетове - цяло число в интервала [1 … 10000]

Изход
На конзолата се отпечатва 1 ред:
•	Цената, която трябва да се заплати, форматирана до втория знак след десетичната запетая,
в следния формат:
"{цената} lv."

"""

fruit = input()
size_set = input()
count_sets = int(input())

price_set: int = 0

if fruit == 'Watermelon':
    if size_set == "small":
        price_set = 2 * 56
    elif size_set == "big":
        price_set = 5 * 28.7
elif fruit == 'Mango':
    if size_set == "small":
        price_set = 2 * 36.66
    elif size_set == "big":
        price_set = 5 * 19.6
elif fruit == 'Pineapple':
    if size_set == "small":
        price_set = 2 * 42.1
    elif size_set == "big":
        price_set = 5 * 24.8
elif fruit == 'Raspberry':
    if size_set == "small":
        price_set = 2 * 20
    elif size_set == "big":
        price_set = 5 * 15.2

total_sum = price_set * count_sets

if 400 <= total_sum <= 1000:
    total_sum *= 0.85
elif total_sum > 1000:
    total_sum *= 0.5

print(f'{total_sum:.2f} lv.')