# Мими има закупени самолетни билети, но в последствие решава да си добави багаж към тях.
# Таксите за багаж се изчисляват въз основа на теглото на чекирания багаж:
# •	до 10кг – 20% от цената на багаж над 20кг
# •	между 10кг и 20кг вкл. – 50% от цената на багаж над 20кг.
# •	над 20кг – таксата се чете от конзолата
# В зависимост от броя на дните, които остават до пътуването, цената се оскъпява:
# •	повече от 30 дни - цената на багажа се оскъпява с 10%
# •	между 7 и 30 дни вкл. - цената на багажа се оскъпява с 15%
# •	по-малко от 7 дни - цената на багажа се оскъпява с 40%
# Напишете програма, която пресмята колко ще трябва да заплати Мими, спрямо горните условия.\

# Вход:
# От конзолата се четат 4 реда:
# 1.	Цената на багаж над 20кг - реално число в диапазона [10.0…80.0]
# 2.	Килограми на багажа – реално число в диапазона [1.0…32.0]
# 3.	Дни до пътуването – цяло число в диапазона [1…60]
# 4.	Брой багажи – цяло число в диапазона [1…10]

# Изход
# Да се отпечата на конзолата сумата, която ще трябва да заплати Мими за багажите, в следния формат:
# •	" The total price of bags is: {цената на багажите} lv. "
# Сумата да бъде форматирана до втората цифра след десетичния знак.

luggage_more_than_20_kg = float(input())
luggage_kg = float(input())
days_to_fly = int(input())
luggage_count = int(input())

luggage_price = 0

if luggage_kg < 10:
    luggage_price = luggage_more_than_20_kg * 0.20
elif 10 <= luggage_kg <= 20:
    luggage_price = luggage_more_than_20_kg * 0.50
elif luggage_kg > 20:       #else:
    luggage_price = luggage_more_than_20_kg


if days_to_fly < 7:
    luggage_price *= 1.40 * luggage_count
elif 7 <= days_to_fly <= 30:
    luggage_price *= 1.15 * luggage_count
elif days_to_fly > 30:      #else:
    luggage_price *= 1.10 * luggage_count

print(f'The total price of bags is: {luggage_price:.2f} lv.')