"""
https://judge.softuni.org/Contests/Practice/Index/1637#0

Бабата на Деси всяка година приготвя обяд за семейството си за Великден. Напишете програма, която изчислява какви
разходи ще има по приготвянето на обяда, като знаете колко броя козунаци, кори с яйца и килограма курабии е купила.
Цените на продуктите са следните:
•	Козунак  – 3.20 лв.
•	Яйца –  4.35 лв. за кора с 12 яйца
•	Курабии – 5.40 лв. за килограм
•	Боя за яйца - 0.15 лв. за яйце

Вход
От конзолата се четат 3 реда:
•	Брой козунаци - цяло число в интервала [0 … 99]
•	Брой кори с яйца - цяло число в интервала [0 … 99]
•	Килограми курабии - цяло число в интервала [0 … 99]

Изход
Да се отпечата на конзолата колко ще са разходите по приготвянето на обяда.
Сумата да бъде форматирана до втория знак след десетичната запетая.
"""

kozunak_amount_pcs = int(input())
eggs_pack_pcs = int(input())
cookies_amount_kg = int(input())

total_sum = kozunak_amount_pcs * 3.2 + eggs_pack_pcs * 4.35 + cookies_amount_kg * 5.4 + (eggs_pack_pcs * 12 * 0.15)

print(f'{total_sum:.2f}')