"""
https://judge.softuni.org/Contests/Practice/Index/1642#6

Напишете програма, която да пресмята колко литра боя е нужна за боядисването на къщa. Като за стените се използва зелена
 боя, а за покрива – червена. Разхода на зелената боя е 1 литър за 3.4 м2, а на червената – 1 литър за 4.3 м2.
Стените имат следните размери:
•	Предната и задната стена са квадрати със страна „x“
o	на предната стена има правоъгълна врата с широчина 1.2м и височина 2м
•	Страничните стени са правоъгълници със страни „x“ и „y“
o	и на двете странични стени има по един квадратен прозорец със страна 1.5м
Покривът има следните размери:
•	Два правоъгълника със страни „x“ и „y“
•	Два равностранни триъгълника със страна „x“ и височина „h“
Трябва да пресметнете площта на всички страни и площта на покрива, за да
намерите колко литра от всяка боя ще са нужни.

Вход
От конзолата се четат 3 реда:
1.	x – височината на къщата – реално число в интервала [2...100]
2.	y – дължината на страничната стена – реално число в интервала [2...100]
3.	h – височината на триъгълната стена на прокрива – реално число в интервала [2...100]

Изход
Да се отпечатат на конзолата две числа всяко на нов ред:
•	Литрите зелена боя
•	Литритe червена боя
Форматирани до вторият знак след десетичната запетая.
"""

wall_height = float(input())
wall_length = float(input())
roof_height = float(input())

green_paint = 3.4
red_paint = 4.3
windows = 1.5 * 1.5 * 2
door = 2 * 1.2

#стени
wall_front = wall_height * wall_height
wall_back = wall_height * wall_height
wall_side = wall_height * wall_length
walls_area = (wall_front + wall_back + wall_side + wall_side) - windows - door

#покрив
roof_side = wall_height * wall_length
roof_triangle = wall_height * roof_height / 2
roof_area = (roof_side * 2) + roof_triangle * 2

green_paint_needed = walls_area / green_paint
red_paint_needed = roof_area / red_paint

print(f"{green_paint_needed:.2f}")
print(f"{red_paint_needed:.2f}")



